{
  "site": {
    "Gatsby Default Starter": "Yuang's Portfolio",
    "footer": "Built with Gatsby"
  },
  "home": {
    "iam": "Hi, I am",
    "name": "Yuang Li",
    "iama": "I am a",
    "title": "Full-Stack Designer",
    "mymissionis": "My mission is",
    "mission": "Combining art and technology, I create unconventional experiences for people's consciousness as well as deliver consistent experiences for users across the cultures, nations and types of accessibility.",
    "link": "Go to page 2",
    "contactme": "Contact Me",
    "resume": "Resume"
  },
  "tripple": {
    "id": 1,
    "name": "tripple",
    "title": "tripple",
    "position": "Project Manager",
    "abstract": "As a project manager, I take charge of scheduling meetings, hearing team members concerns, moderate conflicts and sharing updates with the DIGM team, CCI team and advisors.",
    "categories": [
      "Immersive",
      "UX"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "In the span of nine months, our team plans on creating an immersive digital art exhibit for our senior capstone project. With a user-centered design process, we hope to successfully achieve our goal of the project; we believe that an immersive digital media exhibit that is dynamically affected by the outcome of different biosensors for residents of the Philadelphia area will facilitate spontaneous creative collaboration between strangers. We’ll know this is true when we see participants communicating with each other to achieve an outcome.",
    "content": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.\n dsdjaksj\n For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University."
  },
  "gs1": {
    "id": 2,
    "name": "gs1",
    "title": "GS1 Digital Link",
    "position": "UI / UX Design Intern",
    "abstract": "Intern as a lead UI / UX Designer for eoko.inc. I am helping the company to improve the UI and UX of both eoko app and CloutQuiz app.",
    "categories": [
      "UI/UX",
      "Graphic",
      "Dev"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
    "content": "<h2 class=\"fg-white\">dashdjsajlk</h2>"
  },
  "eoko": {
    "id": 3,
    "name": "eoko",
    "title": "eoko App",
    "position": "UI / UX Design Intern",
    "abstract": "Intern as a lead UI / UX Designer for eoko.inc. I am helping the company to improve the UI and UX of both eoko app and CloutQuiz app.",
    "categories": [
      "UI/UX",
      "Graphic",
      "Dev"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
    "content": {
      "process_title": "Process",
      "process": "For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University.",
      "implementation_title": "Implementation",
      "implementation": "For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University.\n The Interface designed before I joined doesn't have a clear hierarchy shown on the layout and the style is also not well polished (Screenshoot shown below). It was built by Adobe Illustrator for wireframing and IOS UI components as style guide. \n ",
      "deliverable_title": "Deliverable",
      "deliverable1_title": "Homebase, always be up to day",
      "deliverable1_description": "Upload your cover photos for easy in house adds, see what happening today and plan anything you need for tomorrow.",
      "deliverable2_title": "Hangouts",
      "deliverable2_description": "Members can create an hangout to invite all other members to their casual event, members always know when other members are free and hanging out.",
      "deliverable3_title": "Booking",
      "deliverable3_description": "Booking will not only be seemly but it won't be annoying. Create rooms, availability and even charge per use.",
      "deliverable4_title": "Marketplace",
      "deliverable4_description": "Marketplace to sell and buy internally. Create categories, and let it go.",
      "result_title": "Result",
      "result": "The destination of the two weeks sprint is the client meetings. Our public relations team reached out to 3 local start-up accelerators. I attended 2 of them and helped the interpretation of the user experience process, and user scenario narration. \n We gained valuable feedbacks from the clients by telling the story of themseleves managing the team, and how having a mobile app will help them. At the same time, they also indicate the their expectation on us."
    }
  },
  "busbuddy": {
    "id": 4,
    "name": "busbuddy",
    "title": "BusBuddy",
    "position": "UI / UX Design Intern",
    "abstract": "Intern as a lead UI / UX Designer for eoko.inc. I am helping the company to improve the UI and UX of both eoko app and CloutQuiz app.",
    "categories": [
      "UI/UX",
      "Graphic",
      "Dev"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
    "content": "Welcome to your new Gatsby site.\nNow go build something great."
  },
  "ptf2019": {
    "id": 5,
    "name": "ptf2019",
    "title": "Portfolio 2019",
    "position": "UI / UX Design Intern",
    "abstract": "Intern as a lead UI / UX Designer for eoko.inc. I am helping the company to improve the UI and UX of both eoko app and CloutQuiz app.",
    "categories": [
      "UI/UX",
      "Graphic",
      "Dev"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
    "content": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.\n dsdjaksj\n For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University."
  },
  "schmearit": {
    "id": 6,
    "name": "schmearit",
    "title": "Schmear It",
    "position": "UI / UX Design Intern",
    "abstract": "Intern as a lead UI / UX Designer for eoko.inc. I am helping the company to improve the UI and UX of both eoko app and CloutQuiz app.",
    "categories": [
      "UI/UX",
      "Graphic",
      "Dev"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "link": "Go back to the homepage",
    "paragraph": "I joined eoko.inc in October 2018 as a lead UI / UX designer as well as helping to build the front end development of the web apps, CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning our branding of the company, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
    "content": {
      "overview_title": "Overview",
      "overview": "Over the past 10 weeks our group has been working closely with Schmear It and their customers to create a brand new mobile ordering experience. We conducted primary research, went through multiple rounds of ideation and user testing, and ultimately created a final interactive mockup in Sketch and Flinto. Through this process we learned the importance of collaboration, user testing, team meetings, and understanding business requirements. We are extremely pleased with the final application and hope users love it as well.",
      "context&challenge_title": "Context and Challenge",
      "context&challenge": "Schmear It is a local Philadelphia bagel food truck established in 2013 and recently expanded into a physical location in October 2016. Our team was tasked with developing a mobile application for Schmear It that provided mobile ordering, rewards, and business information for their customers. This application would substitute their existing order ahead solution on their website. We worked closely with Schmear It and their customers to test and develop this mobile application over the past 10 weeks.\nWhile Schmear It already had a mobile ordering function built into their website. It was not advertised or communicated to users very clearly on their website (especially the mobile site) or at their physical locations. The goal of this application was to bring mobile ordering to Schmear It in an accessible and discoverable way for users, while preserving the unique personality and branding Schmear It has developed. The application should also promote their build-your-own option as this is their preferred way for people to order and their collaboration with charities.",
      "process&insight_title": "Process and Insight",
      "process&insight1": "We began the design process by establishing a relationship with Schmear It. We created a business model canvas and project model canvas for the company. After that we began visiting the truck and store to observe the ordering process and the customer experience Schmear It provides. Based upon that, we did the SWOT analysis and affinity mapping for further understanding the experience we should deliver.",
      "process&insight2": "Beside of the group activities, we all reached out to the our potential target audience, and conducted user interviews with them. We practiced the scripts that had been written, and took notes as well.",
      "process&insight3": "From there we began conducting competitive research on competing mobile ordering applications to determine what ideas, flows, and features were already on the market. We determined our target audience based on the surrounding area and the customers we saw from visiting Schmear It. We determined our primary customer types were students, commuters, medical professionals, and to a lesser degree tourists.",
      "process&insight4": "After our initial research and planning, we began to sketch wireframes for potential designs and user flows. This process, like every process was collaborative and we went through 2 rounds of wireframes before moving to digital mockups.",
      "process&insight5": "We then began creating wireframes in Sketch and tested paper prototypes with users. After testing with paper prototypes we moved into testing digital mockups with scripted user interviews. We repeated this testing every week from weeks 6-10. After each round of testing we regrouped as a team, discussed our user feedback, and determined what changes needed to be made for the following week. Collectively we tested with approximately 50 users over weeks 6-10. \n In week 7, we began using Flinto to add animation and navigation to our prototypes. The navigation went through several revisions as the first few prototypes were difficult to navigate. By week 10 we had a final prototype that went through one final round of testing and validation.",
      "process&insight6": "Overall we split the initial wireframe sketches and user testing between each team member. Alex Aslid created mockups in sketch and the final presentation. Alex Huffaker helped create standardized UI elements in Sketch and the final case study.I created the initial wireframes in Sketch for testing and animations in Flinto. Jordan focused on talking with the business, users. Miles was responsible for creating graphics and polish the final version in Sketch before it was passed off to the Flinto team.",
      "solution_title": "Homebase, always be up to day",
      "solution1": "From the start we wanted ordering to be as easy and fast as possible. This was a defining trait that drove our design decisions. This led to the removal of an initial sign up screen and was a driving factor for the adoption of an ever-present card style cart. \n The home screen allows the users to dive immediately into the menu and ordering process. A card-style cart is persistent at the bottom of the ordering section of the application. The location and account pages are positioned to the left and right respectively and can be navigated with a swipe left or right or by tapping the respective icon from the navigation bar. \n The location and times of the truck are clearly displayed under the about section so users are aware it closes early and the location changes. Rewards status, past orders, and account settings are all under one screen thanks to user feedback and provide a general account overview.",
      "solution2": "Rewards status, past orders, and account settings are all under one screen thanks to user feedback and provide a general account overview. \n Custom orders guide users through a step by step flow where they can select their bagel type, toasted option, base spread, and mix-ins. Each of the bagel icons were recreated in Schmear It's graphic style. \n The checkout process allows for setting a custom pickup time and location when ordering ahead.",
      "solution3": "The payment info screen displays the user's rewards status and alerts them if a reward is available before they complete the checkout. We also accept multiple forms of payment including Apple Pay for faster checkouts. \n The order confirmation screen clearly shows the location and estimated pickup time. It also has a barcode for the store to scan upon pickup. \n Once an order is placed, a new order status button appears on the home screen.",
      "result_title": "Result",
      "result": "Overall we feel this project has been very successful due to the branding, ease of use, and feedback from users. We met all of the business' criteria to promote custom orders. User feedback was tracked through quantitative user studies with users reporting increasing satisfaction week to week. The application itself is very straight forward with its ordering process and the lack of an initial sign up screen greatly decreases first time setup for new users. \n Creating a consistent meeting time really helped us stay on track even if one or two members weren't able to make it that week. These meetings became less consistent as the project began wrapping up due to external conflicts from group members and affected the final product. In the future we would be stricter about these team meetings and at least one occurred a week outside of class. Sharing Sketch and Flinto files between the team also proved an obstacle as the team multiple versions for testing and the roles changed weekly."
    }
  }
}