{
  "site": {
    "Yuang Li": "Yuang's Portfolio",
    "footer": "Check the code on"
  },
  "home": {
    "iam": "Hi, I am",
    "name": "Yuang Li",
    "iama": "I am a",
    "title": "Full-Stack Designer",
    "mymissionis": "My mission is",
    "mission": "Combining art and technology, I create experiences for arousing people's consciousness and empathy, as well as use usability processes, methods, and techniques to address consistent experiences of accessibility.",
    "contactme": "Contact Me",
    "resume_title": "Resume",
    "resume": "/resume_yuangli.pdf",
    "viewmore": "View more"
  },
  "tripple": {
    "id": 1,
    "name": "tripple",
    "title": "tripple",
    "position": "Project Manager",
    "abstract": "I managed a art installation project agilely by planning sprint, hosting meeting, creating customer stories and communicating with product owner",
    "categories": [
      "Immersive",
      "Management"
    ],
    "button1": "GitHub",
    "button2": "Teaser",
    "content": {
      "overview_title": "Overview",
      "overview": "In the span of nine months, our team created an immersive digital art exhibit for our senior capstone project. We believe that an immersive digital media exhibit that is dynamically affected by the outcome of different biosensors for residents of the Philadelphia area will facilitate spontaneous creative collaboration between strangers. We’ll know this is success when we see participants communicating with each other to achieve an outcome.",
      "pm_title": "Project Management System",
      "pm_team_title": "Team build-up",
      "pm_team": "Our multidisciplinary team is composed of 14 students - six digital media students, six CCI students, and two students in the music industry program. Our team is subdivided into different departments:  project management, communication, creative design, UX research, development/technology, and sound design. As a team with a diverse set of skills and an amazing advisor, we are confident in pulling this off for our senior project.",
      "pm_agileWorkflow_title": "Agile Workflow",
      "pm_agileWorkflow": "The whole team worked on 2-weeks design sprints. UX will be spent on research (surveys, interviews, personas) and the other week would be testing and making the changes. Creative team will reference UX research insights and create the design decisions. The whole experience will be working in three phases: pre-exhibit which will focus on how to get people to the exhibit and onboarding, during the exhibit which will focus on the collaboration and the interaction design of the exhibit and post exhibit which will focus on how to get the best feedback that will help us improve our exhibit.",
      "pm_tools_title": "Tools",
      "pm_tools": "We used Microsoft Team as our communication tool. Shotgun Studio for task management and gantt chart.",
      "creativeProcess_title": "Creative process",
      "creativeProcess_concept_title": "Arriving at Our Concept (Redefining Core Functionality)",
      "creativeProcess_concept": "When we first came into this project, we did tone of researches on what we need to build an immersive art exhibition and how to make it engaging and meaningful to the audience. Members in the team read and analyzed case studies and we made decision 1) use TouchDesigner as our engine. 2) interactive 3) bring people consciousness and empathy. 4) encourage collaboration between audience. \n For interactiveness, we first tried Xbox Kinect as our only component. Since the problem we trying to solve was helping Philadelphian to step outside the busy modern life and feel relax, we want the interaction to be more abstract than literal. Also, with bio-sensor we can easily build up the connection to audience's emotion. We decided that it would be most interesting to actually embed the biosensors in the space and have the data from the sensors dynamically affect the exhibit. \n After sessions of brainstorming , we had discussed the potential for spontaneous creative collaboration between the participants in the exhibit. If everyone’s sensor was affecting the room in a different way, it seemed natural that participants would begin to interact with each other in order to affect the exhibit in more dramatic ways. \n We concluded that the music, colors, and animation speed regarding the graphics would be affected by the heart rate. We believed that these aspects would produce the most interesting outcomes without making the experience too jarring. We tweaked the interactions to affect the music, phase/level, and the colors of the graphics based on the user’s heart rate.",
      "creativeProcess_aesthetic_title": "Determining Our Aesthetic",
      "creativeProcess_aesthetic_theme_title": "Theme",
      "creativeProcess_aesthetic_theme": "From the potential interactions discussed in the brainstorming exercise, we came up with 5 levels to the exhibit. Or 5 potential states of the exhibit which the participants would experience. These states were meant to mimic the ocean at different depths. The idea was that participants would be able to associate the raising and lowering of their heart rate with raising and lowering of their position in the ocean. We created mood boards to illustrate the theme, and three moodboards to explore art styles.",
      "creativeProcess_aesthetic_color_title": "Color Palettes",
      "creativeProcess_aesthetic_color": "We created a set of color palettes to go along with it, and created a different color for each levels of the exhibit. We decided that we wanted to have five levels to our exhibit, each representing a different depth in the ocean. The levels. The levels we came up with were shallow seas, coral reef, open ocean, caves, and deep sea. The colors had to be saturated enough to project, and easily blend together from one level to the next, since they needed to change fluidly from one level to the next",
      "creativeProcess_aesthetic_styleguide_title": "Style Guide",
      "creativeProcess_aesthetic_styleguide": "Finally, we created a style guide for the exhibit, meant to coordinate the effort of multiple artists, so our graphics would be consistent and cohesive based on principles.",
      "creativeProcess_aesthetic_styleguide_list": "That the colors would need to blend from one level to the next, and therefore we were working with color spectrums \n Transparency could be used to give 2 dimensional graphics depth, while technically keeping them all one color \n The graphics should be created by using a singular piece of geometry, and transforming it repeatedly in the same way",
      "creativeProcess_aesthetic_styleguide_link": "View Style Guide",
      "creativeProcess_aesthetic_graphic_title": "Dynamic graphics",
      "creativeProcess_aesthetic_graphic_1": "Based on our style guide, we explored many different shapes with varying opacities to create interesting abstract graphics. We decided on abstract art rather than concrete because we did not feel the need to have specific graphics to ultimately portray the concept. We still want to encourage creativity and imagination among participants.",
      "creativeProcess_aesthetic_graphic_2": "The graphics were built using TouchDesigner.",
      "experience_title": "Refining the experience",
      "experience_uxresearch_title": "UX research",
      "experience_uxresearch": "Define the whole experience and core features based on the research was the next step. Team discussed potential ideas for every aspect of the exhibit, from the moment participants entered the building until they left. We mapped out the entire experience by creating a affinity map, and then took the selected ideas into consideration of the UX research. \n After that, we conducts multiple rounds of survey for understanding people's opinion on digital/traditional art exhibition, and their a good collaborative experience (what motivates and demotivates them to collaborate). In order to know more about their experience on collaborative creation in exhibition, we also conducted semi structured user interviews. UX team gathered up and came up with possible questions for the interview and how we can get the best insights from the interviews. \n Based on all the insights we got from our interviews, we created user personas describing the user behavior and their emotions towards collaboration. This varies from the traditional persona design, but we chose this as we believed it would be the best template to understand in depth about the user pain points and come up with solutions. Each team member created a persona and then we came up with a common persona that combined similar user pain points and frustrations and added some possible solutions to improve the collaboration aspect of our exhibit. ",
      "experience_testing_title": "Usability testing",
      "experience_testing1": "After this, we continued to make design updates and came up with an Alpha prototype in the midway of the project. This was the perfect opportunity to get some user feedback and keep improving based on it. So, we created a user testing script to see if people preferred free exploring or performing given tasks and what they thought of our current design and visuals. \n We designed two tasks for users to complete. They are free exploration and increasing & decreasing the heart rate. After testings, we asked them for their most and least favorite parts of the design, and their concerns while doing the tasks. UX team took notes and analyzed the key findings from the testings.",
      "experience_testing2": "This round of testing gave us a lot of valuable insights, some of the most important one being that we needed to add a story element for the users and let them explore rather than giving them certain tasks.",
      "experience_uxresearch_report1": "Testing#1 Report",
      "experience_uxresearch_report2": "Testing#2 Report",
      "experience_storyboard_title": "Storyboard",
      "experience_storyboard_link": "Full Storyboard",
      "tech_title": "Technology",
      "tech_sensor_title": "Pulse Sensors",
      "tech_sensor": "We used Arduino nano with built-in wifi module for customizing our own hearts rate sensor. When it came to getting correct data we learned that the program we were using to build the exhibit had tools for leveling out data, and getting a less jumping more accurate stream. When it came to the durability of the sensors we decided to design an arm band which would protect the sensors. And our development team built an LED ring which would light up faster or slower depending on the data coming from the sensor, so our participants would have a visual representation of their heart rates.",
      "tech_touchdesigner_title": "TouchDesigner",
      "tech_touchdesigner": "The system we build was made entirely of generative graphics, meaning all of the graphics were generated by some type of algorithm, and nothing was created in outside software. The reason we chose to do this was because we were altering certain aspects of the exhibit with data, and if the graphics were created from code it was much easier to alter components of them based off that data. \n We decided to have each sensor change a different aspect of the exhibit. One changed color, one changed phase of animation, and one changed the music. The data from the heart rate sensors was read by the PulseSensor library, and then could be printed in TouchDesigner. From there the data went through a series of alterations to make sure it didn’t jump suddenly, there were no zeros, and that any data which seemed incorrect would be ignored. After this math was applied to the data so that the numbers fit within the range of whichever parameter they were changing. This ranged data was then attached to different parameters.",
      "prod_title": "Production & execution",
      "prod_venue_title": "Venue",
      "prod_venue": "While finding a potential space, our team had to think about whether there was enough space for three people to collaborate, if the space would be too big, extra space for onboarding or exiting, where to set up computers, etc. Ultimately we secured a venue spot in Old City that utilizes one 9ft X 9ft screen, and the event will happen during Philly Tech Week.",
      "prod_marketing_title": "Marketing",
      "prod_website_title": "Website",
      "prod_website_link": "Link to Website",
      "conclusion_title": "Conclusions",
      "conclusion": "Although we are extremely disappointed that the covid-19 pandemic prevented us from completing this project, we are grateful for how much we were able to learn through this process. The ability to abstract the skills that we learned in our user experience design classes, and apply them to a completely different type of project opened up a new way of thinking, and made us feel more confident in our abilities. Working with technology we had never worked with before proved to be challenging, but ultimately the experience we gained with user Arduino, biosensors, and TouchDesigner opens up an entirely new realm of opportunities for the future. We hope to someday finish this project, when the world has returned to some sense of normalcy."
    }
  },
  "gs1": {
    "id": 2,
    "name": "gs1",
    "title": "GS1 Digital Link",
    "position": "UI / UX Design Intern",
    "abstract": "Interned as a business intelligence analyst and mobile app developer. In 6 months, I participated in mutiple B2B and B2C e-commerce projects with the company",
    "categories": [
      "UI/UX",
      "Dev",
      "Intern"
    ],
    "button1": "Resolver",
    "button2": "Activate",
    "content": {
      "myrole_title": "My role",
      "myrole": "I interned as a business intelligence analyst and mobile app developer for 6 months at GS1 Global. In 6 months, I participated in multiple projects that are B2B and B2C by following an agile project management system. The experience provided me an opportunity to gain multi-faceted skillsets and brought insights to teams and the companies. ",
      "highlights_title": "Highlights",
      "highlights_resolver_title": "GS1 Resolver",
      "highlights_resolver": "In this project, I designed and developed a mobile application for GS1 Resolver, a service based on the GS1 Digital Link standard. The brand owner can provides traceability information about the product. At the same time, the resolver can link an identified item to information for business partners such as recall status APIs, master data, hazardous handling instructions and more. Links to those information sources can be updated at any time, perhaps to point to promotions or updated information. It means the barcode works as a gateway to unlimited resources to support brand owners' B2B and B2C operations. \n As a team, we first analyzed the backend for executing the API calls, and then mapped out the information architecture for the app. My role was design the interface with UI kit by following the GS1 style guide and language style guide. The wireframe was built using Adobe XD and shared via Zeplin. I was also in charge of building the front end using Android Studio. In total, I wrote more then 3,000+ line of code supporting supporting front and back-end.",
      "highlights_resolver_link1": "Zeplin",
      "highlights_resolver_link2": "Resolver APP Code",
      "highlights_resolver_link3": "Global Scanner Code",
      "highlights_activate_title": "Optimize UX for GS1 Activate",
      "highlights_activate": "GS1 Activate is the ultimate platform for brand owner to activate their products and then get GS1 barcode numbers (also called Global Trade Item numbers or GTINs) and barcode so brand owner and can sell them in retail.  This project had already been in the market for years, and it's one of keystones for company's future plan. \n In this project, we worked with clients such as Walmart, Amazon, P&G, Alibaba, as well as GS1 MO (Member Organization), GS1 Australia specifically, to help optimize experience of admin, sign in & signup, add product, edit product and user guide. I worked with company's marketing manager and design consultancy. Together, we analyzed issues report sent from MOs and translate our found to design. After design decisions proposed was approved by marketing team, I re-designed the interfaces and sent them to the consultancy for consistency validation. In total, I revised more than 30 screens and they were all been planned for next deliverable of the product.",
      "highlights_activate_link1": "Zeplin",
      "highlights_activate_link2": "activate APP Code",
      "highlights_activate_link3": "Global Scanner Code",
      "highlights_ba_title": "Business Analysis",
      "highlights_ba": "During the co-op, we interns also analyzed market and evaluated service the company was offering. We devised competitive marketing strategies and documented test procedure to ensure replicability and regulatory compliance for softwares.  The report was presented to company's products owners and chief technology officer and chief product officer. ",
      "highlights_ba_link": "View Report"
    }
  },
  "eoko": {
    "id": 3,
    "name": "eoko",
    "title": "eoko App",
    "position": "UI / UX Design Intern",
    "abstract": "Joined eoko.inc as a lead UI / UX Designer. I helped the company on improving UI and UX of both eoko app and CloutQuiz app",
    "categories": [
      "UI/UX",
      "B2B",
      "Contract"
    ],
    "button1": "Company Profile",
    "content": {
      "myrole_title": "My role",
      "myrole": "I joined eoko.inc in October 2018 as an UI / UX designer. I worked on multiple projects with team such as CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning  branding, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
      "process_title": "Process",
      "process": "For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University.",
      "implementation_title": "Implementation",
      "implementation": "For eoko app specifically, this is a two week design and development sprint. My job in the team is to remap the user experience of the app based on the existed features, and redesign the user interfaces with usability testing. Since this project had a relatively clear business plan and a lot marketing researches, my first job is to help the company identity the goal of the Minimum viable product. I spent time talking with business and marketing in the company.\nTogether, we filled out the project canvas, business canvas and UX Questionnaires, which gave me a better knowledges on the target audience and competitive applications. I had some couple long talks with my co-workers about the researches had been done. Another than that, I had done a lot of researches on the ecosystem of the accelerator, and interviewed people at the incubator of Drexel University.\n The Interface designed before I joined doesn't have a clear hierarchy shown on the layout and the style is also not well polished (Screenshoot shown below). It was built by Adobe Illustrator for wireframing and IOS UI components as style guide. \n ",
      "deliverable_title": "Deliverable",
      "deliverable1_title": "Homebase, always be up to day",
      "deliverable1_description": "Upload your cover photos for easy in house adds, see what happening today and plan anything you need for tomorrow.",
      "deliverable2_title": "Hangouts",
      "deliverable2_description": "Members can create an hangout to invite all other members to their casual event, members always know when other members are free and hanging out.",
      "deliverable3_title": "Booking",
      "deliverable3_description": "Booking will not only be seemly but it won't be annoying. Create rooms, availability and even charge per use.",
      "deliverable4_title": "Marketplace",
      "deliverable4_description": "Marketplace to sell and buy internally. Create categories, and let it go.",
      "result_title": "Result",
      "result": "The destination of the two weeks sprint is the client meetings. Our public relations team reached out to 3 local start-up accelerators. I attended 2 of them and helped the interpretation of the user experience process, and user scenario narration. \n We gained valuable feedbacks from the clients by telling the story of themseleves managing the team, and how having a mobile app will help them. At the same time, they also indicate the their expectation on us."
    }
  },
  "busbuddy": {
    "id": 4,
    "name": "busbuddy",
    "title": "BusBuddy",
    "position": "UI / UX Design Intern",
    "abstract": "Over 6 months, we optimized schoolbus commute experience by IoT and web-app. I involved in designing prototype and developing front & back end and Pi",
    "categories": [
      "Interface",
      "IoT",
      "Dev"
    ],
    "button1": "Case Study",
    "button2": "GitHub",
    "content": {
      "overview_title": "Overview",
      "overview": "Bus Buddy is an interactive mobile web-app designed for parents with elementary school level students to help battle against the long morning school commute. With this system, students will no longer have to wait at their bus stop, unaware of their bus’ arrival. \n Bus Buddy is a hardware & software solution that uses an Internet of Things (IoT) approach to eliminate elementary school transportation uncertainties. The system works by using Raspberry PI technology with GPS and RFID sensors which allows students to scan their school IDs as they board their bus, allowing their parents to see where their bus is at any given morning or afternoon via the Bus Buddy app. Bus Buddy also sends parents SMS notifications when students have safely hopped on the bus, and when their bus is running late, a notification is sent with the updated ETA. A live map view with the Bus’ location is also available on the Bus Buddy app. Bus Buddy offers that peace of mind that parents are looking for while also alleviating frustration for students.",
      "process&insight_title": "Process and Insight",
      "process&insight_1_title": "Measure for Success (MVP) ",
      "process&insight_1": "This project spanned a total of 6 months. The first three months our team dedicated all of our time and resources determining the kind of product we want to deliver, and to whom we want to target this product. We conducted formal research and surveyed/interviewed our target demographic- parents of young children that rode the bus- to better determine what process worked they best for them, and how they usually operate in the day to day when it comes to making sure their children get onto the bus safely.",
      "process&insight_2_title": "User Research",
      "process&insight_2_1": "This application/system is mainly meant for busy parent(s) that have a young child who takes the bus to school. Because of their child’s age, they generally do not have a cellphone to notify parents of their safe arrival at school. Through our research, we have determined our target audience will be: Parent(s) of children required to take the bus too and from school or for other after school activities & Parent(s) of children between the ages of 5-12 years old.",
      "process&insight_3_title": "Flowchart",
      "process&insight_3": "With utilizing all of these technologies came an extra level of complexity when it came to mapping out a complete system, which includes the database, bus driver, school, and parent application would communicate with each other. We mapped it out into a cohesive task flow.",
      "process&insight_4_title": "Style Guide",
      "process&insight_4": "When it came to designing the style guide, we wanted to make sure to evoke a simple, youthful, and educational kind of feeling and aesthetic. Rounded corners and bright vibrant colors kind of style can be closely associated with schools, to create an idea that this application is both very simple and intuitive to use. \n We pulled various design principles from Material Design, and transformed them into more playful and stylized components, to create harmony between the uniqueness of the idea by making the look have its own unique feel.",
      "process&insight_4_visuallink": "Visual Style Guide",
      "process&insight_4_languagelink": "Language Style Guide",
      "process&insight_5_title": "Prototype",
      "development_title": "Development",
      "development_1_title": "Technology",
      "development_1": "BusBuddy utilizes the MERN stack, using MongoDB to store information, Express to handle the server in JavaScript, React to easily create our interface, and NodeJS for everything else. \n The Bus Buddy device utilizes a Raspberry Pi with RFID scanners and GPS tracking unit, which runs our custom python scripts to communicate with our web server. \n The map was created using the jQuery library Leaflet.js, with an added overlay to show the maps path throughout the journey from stop to stop.",
      "development_2": "For the onboard device, we decided to focus on developing a Raspberry Pi device that can be put onto each bus. This allows us to access GPS data, include an RFID reader, and add on any other attachment we may need. This was by far the most difficult part for our development team, especially considering the scripts would work best if wrote in Python, a language not taught in our program. Accessing the data from the hardware was a whole different challenge. \n  For our minimum viable product, we had a prototype device consisting of the Pi, a Mifi wireless router for sending hotspots, a portable battery pack, and a breadboard with RFID devices soldered on. They are all wrapped up in a acrylic case with t-slot edge joints. When the power connects, the Pi will start collecting the GPS information and post the location information data over HTTP to our API. At the same time, the RFID scanner will start listening for the student card scanning event and post the data to a different API endpoint. The parent of that student will receive a text message right away and start receiving the location data of the bus through the app.",
      "solution_title": "The Solution",
      "solution": "Our final project met our expectations in terms of creating a complete system in which children can scan onto the bus using the Pi, retrieve that information into the parent UI, and track the location of the bus. All of these systems have been put into place and are working as intended."
    }
  },
  "schmearit": {
    "id": 5,
    "name": "schmearit",
    "title": "Schmear It",
    "position": "UI / UX Designer",
    "abstract": "In 10 weeks design sprint, we redesigned a mobile ordering experience for Schmear It and their customers and finally delivered a high-fidelity prototype",
    "categories": [
      "UI/UX",
      "Graphic",
      "Prototype"
    ],
    "button1": "Case Study",
    "link": "Go back to the homepage",
    "content": {
      "overview_title": "Overview",
      "overview": "Over 10 weeks design sprint our group has been working closely with Schmear It and their customers to create a brand new mobile ordering experience. We conducted primary research, went through multiple rounds of ideation and user testing, and ultimately created a final interactive mockup in Sketch and Flinto. Through this process I learned the importance of collaboration, user testing, team meetings, and understanding business requirements. We are extremely pleased with the final application and users gave us many positive feedbacks as well.",
      "context&challenge_title": "Context and Challenge",
      "context&challenge": "Schmear It is a local Philadelphia bagel food truck established in 2013 and expanded into a physical location in October 2016. Our team was tasked with developing a mobile application for Schmear It that provided mobile ordering, rewards, and business information for their customers. This application would substitute their existing order ahead solution on their website. We worked closely with Schmear It and their customers to test and develop this mobile application over the 10 weeks. \n While Schmear It already had a mobile ordering function built into their website, it was not advertised or communicated to users very clearly on their website (especially the mobile site) or at their physical locations. The goal of this application was to bring mobile ordering to Schmear It in an accessible and discoverable way for users, while preserving the unique personality and branding Schmear It has developed. The application should also promote their build-your-own option as this is their preferred way for people to order and their collaboration with charities.",
      "process&insight_title": "Process and Insight",
      "process&insight1": "We began the design process by establishing a relationship with Schmear It. We created a business model canvas and project model canvas for the company. After that we began visiting the truck and store to observe the ordering process and the customer experience Schmear It provides. Based upon that, we did the SWOT analysis and affinity mapping for further understanding the experience we should deliver.",
      "process&insight2": "Beside of the group activities, we all reached out to the our potential target audience, and conducted user interviews with them. We practiced the scripts that had been written, and took notes as well. It helps us understood ",
      "process&insight3": "From there we began conducting competitive research on competing mobile ordering applications to determine what ideas, flows, and features were already on the market. We determined our target audience based on the surrounding area and the customers we saw from visiting Schmear It. We determined our primary customer types were students, commuters, medical professionals, and to a lesser degree tourists.",
      "process&insight4": "After our initial research and planning, we began to sketch wireframes for potential designs and user flows. This process, like every process was collaborative and we went through 2 rounds of wireframes before moving to digital mockups.",
      "process&insight5": "From there we made individual mood boards that we combined into a unified team mood board with our color palette, potential iconography, fonts, etc.",
      "process&insight6": "We then began creating wireframes in Sketch and tested paper prototypes with users. After testing with paper prototypes we moved into testing digital prototype with usability testing scripts. We repeated this testing every week from weeks 6-10. After each round of testing we regrouped as a team, discussed our user feedback, and determined what changes needed to be made for the following week. Collectively we tested with approximately 50 users over weeks 6-10.",
      "UsabilityTestScript": "Usability Testing Script",
      "process&insight7": "In week 7, we began using Flinto to add animation and navigation to our prototypes. The navigation went through several revisions as the first few prototypes were difficult to navigate. By week 10 we had a final prototype that went through one final round of testing and validation.",
      "ReflectionNote": "Testing Reflection Notes",
      "solution_title": "Solution",
      "solution1": "From the start we wanted ordering to be as easy and fast as possible. This was a defining trait that drove our design decisions. This led to the removal of an initial sign up screen and was a driving factor for the adoption of an ever-present card style cart. \n The home screen allows the users to dive immediately into the menu and ordering process. A card-style cart is persistent at the bottom of the ordering section of the application. The location and account pages are positioned to the left and right respectively and can be navigated with a swipe left or right or by tapping the respective icon from the navigation bar. \n The location and times of the truck are clearly displayed under the about section so users are aware it closes early and the location changes.",
      "solution2": "Rewards status, past orders, and account settings are all under one screen thanks to user feedback and provide a general account overview. \n Build your own orders guide users through a step by step flow where they can select their bagel type, toasted option, base spread, and mix-ins. Each of the bagel icons were recreated in Schmear It's graphic style. \n The checkout process allows for setting a custom pickup time and location when ordering ahead.",
      "solution3": "The payment info screen displays the user's rewards status and alerts them if a reward is available before they complete the checkout. We also accept multiple forms of payment including Apple Pay for faster checkouts. \n The order confirmation screen clearly shows the location and estimated pickup time. It also has a barcode for the store to scan upon pickup. \n Once an order is placed, a new order status button appears on the home screen.",
      "solution_flinto-link": "Download Flinto File",
      "result_title": "Result",
      "result": "Overall we feel this project has been very successful due to the branding, ease of use, and feedback from users. We met all of the business' criteria to promote custom orders. User feedback was tracked through quantitative user studies with users reporting increasing satisfaction week to week. The application itself is very straight forward with its ordering process and the lack of an initial sign up screen greatly decreases first time setup for new users. \n Creating a consistent meeting time really helped us stay on track even if one or two members weren't able to make it that week. These meetings became less consistent as the project began wrapping up due to external conflicts from group members and affected the final product. In the future we would be stricter about these team meetings and at least one occurred a week outside of class. Sharing Sketch and Flinto files between the team also proved an obstacle as the team multiple versions for testing and the roles changed weekly."
    }
  }
}