{
  "site": {
    "Yuang Li": "李雨昂作品集",
    "footer": "网站代码见"
  },
  "home": {
    "iam": "你好我是",
    "name": "李雨昂",
    "iama": "我的职位是",
    "title": "全栈设计师",
    "mymissionis": "我的设计理念是",
    "mission": "结合艺术和科技技术，我致力于创造出可以唤起人们潜意识与引发共鸣的体验。除此之外，通过可用性研究方法和技术为身体或条件受限制的用户解决问题以获得易懂易操作的用户体验。",
    "contactme": "联系我",
    "resume_title": "个人简历",
    "resume": "/李雨昂简历.pdf",
    "viewmore": "查看更多"
  },
  "tripple": {
    "id": 1,
    "name": "tripple",
    "title": "tripple",
    "position": "项目经理",
    "abstract": "作为项目经理参与制作一项交互数字艺术展览，职责包括计划Sprint、 组织并主持会议，制作用户故事、以及与上级汇报。",
    "categories": [
      "沉浸式体验",
      "项目管理"
    ],
    "button1": "代码",
    "button2": "纪录短片",
    "content": {
      "overview_title": "综述",
      "overview": "在九个月的时间里，我们的团队打造了一个身临其境的大型交互数字艺术展览，我们策划通过心跳传感器来实现展览中事件的动态反馈，以此来促进参与者之间的自发创意合作，从而达到的体验目的。",
      "pm_title": "项目管理体系规划",
      "pm_team_title": "团队建成",
      "pm_team": "我们的团队由14名学生组成，这其中包括6名数字媒体学生，6名计算机科学学生和2名音乐制作学生，我把团队分为不同的部门：项目管理，市场，创意设计，UX研究，开发/技术和声音设计。",
      "pm_agileWorkflow_title": "敏捷工作流",
      "pm_agileWorkflow": "我们团队遵循着2周的冲刺原则的敏捷工作流， UX组负责研究（调查，访谈，分析）和可用性测试和进行更改。创意团队将参考UX研究的见解并制定设计决策。整个体验将分三个阶段进行：展前将集中于如何使人们参加展览和入职；展中将集中于展览的协作和交互设计；展后将注重于如何获得最好的反馈，这将有助于我们改善我们的展览。",
      "pm_tools_title": "工具",
      "pm_tools": "我们使用Microsoft Team作为沟通工具。 Shotgun Studio用于任务管理和授权图表。",
      "creativeProcess_title": "创意过程",
      "creativeProcess_concept_title": "定义核心功能",
      "creativeProcess_concept": "当我们开始这个项目时，我们进行了一系列研究，目的是研究如何建立一个沉浸式的艺术展览，以及如何对参观者展现吸引力和意义。团队中创意组对成员大量阅读并研究了类似项目，因此我们做出了以下决定 1）使用TouchDesigner作为我们的主引擎 2）用与数字艺术的互动让观众产生共鸣 3）鼓励观众之间的合作 \n 为了实现交互性，我们首先尝试将Xbox Kinect作为我们的唯一组件。由于我们试图解决的问题是帮助费城居民走出繁忙的现代生活并此感到轻松，所以我们希望这种互动更抽象。此外，借助心跳传感器，我们可以从此得知参观者的感情波动。综上所述，我们认为将心跳传感器参与人机交互并使传感器的数据动态影响展览的视觉体验是十分意义的。 \n 之后，我们讨论了关于展览参观者之间自发的创意合作。如果每个人的感应器都以不同的方式影响着展览，那么参与者自然会开始相互交流，从而可以以更加戏剧化的方式影响展览。 \n 我们由此得出结论，参观者的心率会影响音乐、颜色、动画速率和图像阶段，因为通过改变这些方面可以给观众群带来截然不同的体验，也让此展览更有可玩性。",
      "creativeProcess_aesthetic_title": "美术设计",
      "creativeProcess_aesthetic_theme_title": "主题",
      "creativeProcess_aesthetic_theme": "通过讨论展览中的人机交互，我们提出了体验的5个阶段，这些阶段是模仿了不同深度的海洋，参与者将升高和降低自己的心率以此与海洋中位置的升高和降低相关联。我们创建了说明主题的情绪板和艺术风格的三个情绪板。",
      "creativeProcess_aesthetic_color_title": "色板",
      "creativeProcess_aesthetic_color": "在确定主题之后，我们创建了一组色板，并为展览的每个“阶段”创建了不同的颜色。在展览中每个层次代表了海洋中不同的深度，它们分别是浅海，珊瑚礁，开阔海洋，洞穴和深海。我们要求颜色必须足够饱和才能用于投影，并且必须轻松地从一个层次过渡到下一个层次。",
      "creativeProcess_aesthetic_styleguide_title": "设计规范",
      "creativeProcess_aesthetic_styleguide": "最后，我们为展览创建了设计规范，以此来协调多个设计师一起工作，我们的图像将基于以下原则来保持一致性：",
      "creativeProcess_aesthetic_styleguide_list": "颜色需要从一个级别过渡到下一个级别，因此我们正在使用色谱 \n 透明度可用于赋予二维图形深度，而在技术上将它们全部保留为一种颜色 \n 应通过使用单个几何图形来创建图形，并以相同的方式反复对其进行转换",
      "creativeProcess_aesthetic_graphic_title": "动态图像",
      "creativeProcess_aesthetic_graphic": "根据我们的样式指南，我们探索以创建有趣的符合主题的抽象图形，因为我们不希望特定的图形来最终体现这一概念，我们决定使用抽象艺术，我们希望以此鼓励参与者的创造力和想象力。 \n 这些图形是TouchDesigner构建。",
      "experience_title": "完善用户体验",
      "experience_uxresearch_title": "用户体验研究",
      "experience_uxresearch": "关于UX，我们需要基于研究去定义用户经验和核心功能，团队讨论了展览各个方面可能优化用户设计的地方，我们通过创建亲和图映射整个体验，然后将选定的想法加入了UX研究的主题。\n 我们先进行了多轮调查，以了解人们对数字/传统艺术展览的看法以及他们良好的协作经验（是什么激励他们进行协作）。为了进一步了解他们在展览中进行协作创作的经验，我们还进行了半结构化的用户访谈，UX组成员聚集在一起，为访谈中要提的问题做了讨论，以及如何从访谈中获得最佳见解。 \n 基于我们从访谈中获得的所有见解，我们创建了用户角色，描述了用户的行为及其对共同协作的个人看法。这次用户角色设计与传统有所不同，但是我们还是选择了它，是因为我们认为这是深入了解用户痛苦点并提出解决方案的最佳模板。在此过程中，每个团队成员都创建了一个角色，然后我们商议出了一个将相似的用户痛苦点和挫败感结合在一起的角色，并添加了一些改善展览中协作的可能解决方案。",
      "experience_testing_title": "可用性测试",
      "experience_testing1": "此后，我们继续进行设计更新和完善，在第4个月时，我们发布了Alpha原型。这是获得用户反馈的好时机。因此，UX部门联合开发部门创建了一个用户测试的脚本，通过此来观察用户是否更喜欢自由探索或执行给定的任务，以及对我们设计和视觉效果的看法。 \n UX部门设计了两个任务供用户完成，一是自由探索，二是按照指令增加和降低心率。测试后，我们还询问了他们最喜欢和最不喜欢的设计部分，以及他们在执行任务时所关心的问题。这此过程中，UX团队做笔记并分析了测试的主要发现。",
      "experience_testing2": "我们进行了两轮测试，测试结果给我们提供了许多宝贵的见解，其中很重要的一点是添加一个故事元素，并借此机会让他们探索而不是规定某些任务，以此我们更新了我们的故事并且以一种份镜的形式展现。",
      "experience_uxresearch_report1": "测试一报告",
      "experience_uxresearch_report2": "测试二报告",
      "experience_storyboard_title": "分镜",
      "tech_title": "科技",
      "tech_sensor_title": "心率脉搏传感器",
      "tech_sensor": "传感器方面，我们使用带有内置wifi模块的Arduino nano来定制我们自己的心率传感器，为了获取正确的数据，我们了解到程序中具有用于平整数据的工具，我们通过此方法获得了稳定的且更准确的数据流。为了保证传感器的耐用性，我们决定设计一条可以保护传感器的臂带。我们的开发团队建立了一个LED环，根据传感器收到心跳的强度，该环会或快或慢地闪烁，因此我们的展览参与者可以直观地看到他们的心律。",
      "tech_touchdesigner_title": "TouchDesigner",
      "tech_touchdesigner": "我们构建的系统完全由自生产的图形组成，这意味着所有图形均由某种类型的算法生成，并且无需外界应用的支持。我们之所以选择这样做是因为，当我们使用数据来更改展览的某些方面，通过代码创建的图形来更改组件要容易得多 \n 我们决定让每个传感器改变展览的不同方面，一种改变颜色，一种改变动画阶段，另一种改变音乐。 PulseSensor库读取了来自心率传感器的数据后，可以在TouchDesigner中进行读取和运用。从此，数据经过一系列修改，以确保它不会大幅波动或数据丢失，并且把所以不正确的数据都将被忽略。将数学运算应用到数据后，数字便会限制在参数范围内，因此将此范围数据用于前端。",
      "prod_title": "制作",
      "prod_venue_title": "场地",
      "prod_venue": "在寻找可以给我们办展的场地时，我们的团队考虑了多个问题：是否有足够的空间供三个人进行协作、空间是否太大、是否有等待区和和工作人员区的额外空间、在何处安装计算机等。最终，我们找到了一个在费城老城区的一个场地，此场地拥有灯光和音乐系统和一个9英尺X 9英尺的大屏幕，我们与场地负责人达成协议，活动将在Philly Tech Week期间举行。",
      "prod_branding_title": "品牌",
      "prod_website_title": "网站",
      "prod_website_link": "网站链接",
      "conclusion_title": "结论",
      "conclusion": "尽管我们对新冠病毒的全球大流行使我们无法完成此项目，但我们对通过此过程中学到的知识。我们运用我们在用户体验设计课程中学习的技能并将其应用于一个完全不同类型的交互的项目，这开辟了一种新的思维方式，使我们对自己的能力更有信心。学习和使用新技术和编程语言是具有挑战性的，但是我们最终还是完成了在整个系统，学习Arduino，心率传感器和TouchDesigner上获得的经验为我们打开了一个全新的更大型的交互领域。同时，我们希望大流感结束后，我们可以把此项目展出。"
    }
  },
  "gs1": {
    "id": 2,
    "name": "gs1",
    "title": "GS1 Digital Link",
    "position": "UI / UX 设计师",
    "abstract": "担任商业产品分析师和应用工程师的实习生，在此期间与各部门合作参与多个B端和C端电子商务产品的开发",
    "categories": [
      "产品分析",
      "开发",
      "实习"
    ],
    "button1": "Clout Quiz",
    "button2": "eoko",
    "content": {
      "myrole_title": "我的职责",
      "myrole": "我在GS1 Global实习了6个月，担任业务分析师和移动应用程序开发人员。在6个月的时间里，我参与研发了多个B2B和B2C项目，也学习并实践了敏捷项目管理相关的知识。这次经验让我获得了提升多方面技能的机会，同时也为公司和团队带来了自己的贡献和未来发展方针。",
      "highlights_title": "高光",
      "highlights_resolver_title": "GS1 Resolver",
      "highlights_resolver": "在这个项目中，我为GS1 Resolver团队设计和开发了一个移动应用程序，它是基于GS1 Digital Link标准的科技项目。此软件给品牌所有者提供了一个平台去介绍产品的可追溯性信息，同时也帮助公司们将自己的产品的信息分享给业务合作伙伴，例如获取状态API，主数据，危险处理说明等。这些信息源的链接可以随时被更新，比如产品的促销或内容的更新，这意味着条形码可作为公司提供资源的门户，以此来帮助品牌所有者对B2B和B2C产品的经营。 \n 作为一个团队，我们首先分析了用于执行API调用的后端，然后为该应用程序制作了信息体系结构图。我的角色是按照GS1设计规范指南和语言规范指南去设计新的UI套件的界面。再次过程中我使用Adobe XD构建线框图，然后通过Zeplin共享给组员和产品经理，我同时还负责使用Android Studio构建前端。我总计写了超过3,000多行前端和后端代码以保证产品按时交付。",
      "highlights_activate_title": "Optimize UX for GS1 Activate",
      "highlights_activate": "GS1 Activate是为品牌所有者激活其产品的平台，然后获得GS1认证的条形码编号（也称为全球贸易商品编号或GTIN）从而销售他们的产品。这个项目已经在市场上存在了多年，并且是公司未来计划的基石之一。 \n 我们的客户包含沃尔玛，亚马逊，宝洁，阿里巴巴以及GS1 MO（GS1地区组织）。在此项目中，我与公司的市场经理和设计顾问紧密合作，我们依照客户的反馈进行用户体验优化，其中包括管理员界面、登录和注册、添加产品、编辑产品以及用户指南。我们一起分析了MO提供的的报告，并将其优化转化为设计原型，在提议的设计决策获得营销团队批准后，我重新设计了界面，并将其发送给设计公司做最后的一致性验证。我总共修改了30多个屏幕，所有的设计已经计划在下一次交付该产品时使用。",
      "highlights_ba_title": "业务分析",
      "highlights_ba": "在实习期间，我们以实习生为组分析了公司的市场并评估了公司提供的业务，我们设计了竞争性的营销策略并记录了测试程序，以确保软件的可复制性和法规遵从性。该报告已提交并展示给公司的产品所有者们以及首席技术官和首席产品官。",
      "highlights_ba_link": "分析报告"
    }
  },
  "eoko": {
    "id": 3,
    "name": "eoko",
    "title": "eoko.inc",
    "position": "UI / UX 设计师",
    "abstract": "担任eoko.inc的首席UI/UX设计师为创业公司改善eoko和CloutQuiz应用程序设计和改进用户体验和界面设计",
    "categories": [
      "设计",
      "B端产品",
      "创业项目"
    ],
    "button1": "Resolver",
    "button2": "Activate",
    "content": {
      "myrole_title": "职责",
      "myrole": "I joined eoko.inc in October 2018 as an UI / UX designer. I worked on multiple projects with team such as CloutQuiz App and eoko App. We use an agile workflow and incorporate closely with our business and development teams. My responsibility is designing and redesigning  branding, components, interfaces and user experience for the apps, and participate in the meetings and events. I learnt and practiced new technologies on both design and development aspects from the experience.",
      "process_title": "过程",
      "process": "特别是对于eoko应用程序，这是一个为期两周的设计和开发冲刺。我在团队中的工作是根据现有功能重新映射应用程序的用户体验，并通过可用性测试重新设计用户界面。由于该项目的业务计划相对明确，并且进行了大量的市场研究，因此我的第一项工作是帮助公司确定最低限度可行产品的目标。我花了很多时间与公司的业务和市场营销进行交流。\n 我们一起填写了项目画布，业务画布和UX问卷，使我对目标受众和竞争性应用有了更好的了解。我已经与我的同事进行了几次长时间的讨论，以完成研究。除此之外，我对加速器的生态系统进行了大量研究，并采访了德雷克塞尔大学孵化器的人们。",
      "implementation_title": "执行",
      "implementation": "我加入之前设计的界面在布局上没有清晰的层次结构，样式也没有很好地修饰（如下图所示）。它由Adobe Illustrator构建，用于线框图和IOS UI组件作为样式指南。\nT我以以前的设计为参考，并开始了重新设计过程。代替Adobe Illustrator，我将Sketch与Material Design配合使用作为Atomic Design系统的样式指南。该设计从纸制原型一直都进行了抛光。我们一直根据可用性测试和开发过程来衡量产品，以便我们可以交付最合适的最小可行产品。\n ",
      "deliverable_title": "产品交付",
      "deliverable1_title": "基础，始终保持最新状态",
      "deliverable1_description": "上载封面照片以方便内部添加，查看今天发生的事情并计划明天需要的任何事情。",
      "deliverable2_title": "环聊",
      "deliverable2_description": "成员可以创建视频群聊，邀请所有其他成员参加其休闲活动，成员始终知道其他成员何时有空并进行环聊。",
      "deliverable3_title": "预定",
      "deliverable3_description": "预订不仅是表面上的，而且不会令人讨厌。创建房间，可用性，甚至每次使用收费。",
      "deliverable4_title": "市场",
      "deliverable4_description": "市场内部出售和购买。创建类别，然后放手",
      "result_title": "结果",
      "result": "两周冲刺的目的地是客户会议。我们的公共关系团队与3个本地创业加速器进行了联系。我参加了其中的2个会议，并帮助解释了用户体验过程和用户场景叙述。\n 通过讲述他们自己管理团队的故事以及拥有移动应用程序将如何帮助他们的经验，我们从客户那里获得了宝贵的反馈。同时，它们也表明了对我们的期望。"
    }
  },
  "busbuddy": {
    "id": 4,
    "name": "busbuddy",
    "title": "Busbuddy",
    "position": "UI / UX 设计师",
    "abstract": "使用物联网和Web应用程序技术为低龄学生及其父母设计一套全新的校车体验，参与了原型制作与搭建前后端和树莓派RFID、Wi-Fi、GPS模块",
    "categories": [
      "界面设计",
      "物联网",
      "开发"
    ],
    "button1": "案例分析",
    "button2": "代码",
    "content": {
      "overview_title": "概述",
      "overview": "BusBuddy是一款基于Web的系统和应用程序，专为低龄学生及其父母设计，从而优化他们的校车体验，比如节省等待时间（学生无需盲目的在公交车站等车）。 \n BusBuddy是一款通过硬件和软件间交互的解决方案，它使用物联网（IoT）的方法来消除校车在交通中的不确定性。硬件方面，该系统通过使用具有GPS和RFID传感器的树莓派（Raspberry Pi）来确认上车学生的身份、地点和时间，从而允许他们的父母在校车运营期间通过手机应用查看公交车的位置。当学生安全地上车后，BusBuddy还会向父母发送SMS通知，当校车车迟到时，还将发送带有最新预计到达时间的通知，BusBuddy应用程序中还提供了具有校车位置的实时地图。",
      "process&insight_title": "流程",
      "process&insight_1_title": "衡量标准（最小可行性产品） ",
      "process&insight_1": "该项目共历时6个月，在最初的三个月中，我们的团队投入了全部的时间和资源来确定我们要交付的产品类型以及我们要针对的目标客户群体。我们调研了我们的目标人群：乘坐公共汽车的低年级学生的父母，从此来更好地确定适合他们的解决方案，以及他们对校车体验的态度和他们自己的解决方案",
      "process&insight_2_title": "用户研究",
      "process&insight_2_1": "该应用程序/系统主要适用于有一个小孩乘公共汽车去学校的忙碌父母。由于孩子的年龄，他们通常没有手机来通知父母他们安全到达学校。通过我们的研究，我们确定该年龄约为5-12岁。",
      "process&insight_3_title": "流程图",
      "process&insight_3": "由于整条系统的复杂性，我们用流程图的方式定义这些系统间的活动，包括数据库，校车司机，学校管理层和家长应用程序之间交互的流程，我们将其映射到一个流程图中。",
      "process&insight_4_title": "设计规范",
      "process&insight_4": "在制作设计规范时，我们希望能传达出一种简单、年轻且校园的感觉和美感，圆角和鲜艳的色彩使用户联想起校园环境，从而认为该应用程序非常简单直观。 \n 我们从Material Design中汲取了各种设计原则，并将它们转变为更具趣味性和风格化的组件，以使得其外观具有自己的独特感觉，从而在创意的独特性之间达成和谐。",
      "process&insight_5_title": "原型设计",
      "flintoLink": "下载Flinto原型",
      "development_title": "研发",
      "development_1_title": "科技",
      "development_1": "BusBuddy利用MERN堆栈，使用MongoDB来存储信息，使用Express来使用JavaScript处理服务器，使用React来轻松创建我们的接口，并使用NodeJS来完成其他所有工作。 \n Bus Buddy设备使用Raspberry Pi和RFID扫描仪以及GPS跟踪单元，后者运行我们的自定义python脚本来与我们的Web服务器通信。 \n 该地图是使用jQuery库Leaflet.js创建的，并添加了叠加层以显示从起点到终点的整个过程中的地图路径。",
      "development_2": "对于车载设备，我们决定专注于开发可安装在每条总线上的Raspberry Pi设备。这使我们能够访问GPS数据，包括RFID读取器，并添加我们可能需要的任何其他附件。到目前为止，这对于我们的开发团队来说是最困难的部分，尤其是考虑到脚本如果使用Python（一种在我们的程序中未教过的语言）编写，效果最好。从硬件访问数据是完全不同的挑战。 \n  对于我们最低限度可行的产品，我们有一个原型设备，包括Pi，用于发送热点的Mifi无线路由器，便携式电池组和焊接有RFID设备的面包板。它们全部包裹在带有T型槽边缘接头的丙烯酸盒中。接通电源后，Pi会开始收集GPS信息，并通过HTTP将位置信息数据发布到我们的API。同时，RFID扫描器将开始侦听学生证扫描事件，并将数据发布到其他API端点。该学生的家长将立即收到一条短信，并开始通过该应用程序接收公交车的位置数据。",
      "solution_title": "最终",
      "solution": "在创建一个完整的系统中，我们的最终项目达到了我们的期望，在该系统中，孩子们可以使用Pi扫描到公共汽车上，将这些信息检索到父UI中，并跟踪公共汽车的位置。所有这些系统均已安装到位并按预期工作。"
    }
  },
  "schmearit": {
    "id": 5,
    "name": "schmearit",
    "title": "Schmear It",
    "position": "UI / UX 设计师",
    "abstract": "在十周时间的设计冲刺中与Schmear It以及其客户紧密合作设计了一套全新的移动端线上点餐用户体验，并交付了高保真原型设计",
    "categories": [
      "UI/UX",
      "平面设计",
      "原型"
    ],
    "button1": "案例分析",
    "content": {
      "overview_title": "简概",
      "overview": "在为期十周的设计冲刺中，我们的团队与Schmear It以及其客户紧密合作创造了全新的移动端线上点餐用户体验。我们进行了初步研究，经历了多轮的设计构思和用户测试，并用Sketch和Flinto创建了最终的交互原型设计。通过此过程，我了解了协作、用户测试、团队会议以及理解业务需求的重要性。我们团队对最终的成品感到非常满意，并用户也给出了积极的态度。",
      "context&challenge_title": "背景与挑战",
      "context&challenge": "Schmear It是成立于2013年的费城当地贝果餐车，于2016年10月扩展到门店运营。我们的团队的任务是为Schmear It的移动应用设计原型，其中包括为客户提供线上订餐，奖励机制和宣扬企业文化。此应用程序将替代其网站上现有的线上点餐系统。在这10周内，我们与Schmear It及其客户紧密合作，以测试和开发此移动应用程序的原型。 \n 尽管Schmear It已经在其网站内置了线上点餐功能，但是其网站上并没有提供用户友好的界面来清楚地传递信息（尤其针对移动端）。我们设计目标是打造一种可用和易用的线上订餐体验，同时保留Schmear It的独特的品牌和设计语言。该应用程序还应该推广Schearm it 的 Build your own (自定制) 贝果选项和招牌菜单，同时推广于他们合作的慈善机构。",
      "process&insight_title": "流程与洞察力",
      "process&insight1": "我们通过与Schmear It建立关系开始了设计过程。我们根据调研创建了Schmear It的业务模型画布和项目模型画布。之后，我们多次拜访餐车和餐馆去观察用户的订餐过程和Schmear It为其提供的客户体验。在此基础上，我们进行了SWOT分析、头脑风暴和制作亲和图，以此我们更加了解我们应该设计的经验。",
      "process&insight2": "除了小组活动之外，我们都与产品的目标消费者进行了接触，并与他们进行了用户访谈。我们练习并使用了一起编写的稿词和要提问的问题，并在面谈中记下了笔记。",
      "process&insight3": "之后，我们开始对市场上成功的移动端线上订餐应用进行竞争研究来找寻灵感，以确定市场上已经有哪些想法，流程和功能。我们根据用户访谈、周边环境和Schmear It的顾客确定了我们产品的目标受众：学生，通勤者，医疗专业人员，以及德雷塞尔大学和宾夕法尼亚大学的游学游客。",
      "process&insight4": "经过产品早期的研究和项目的计划，我们开始根据目标用户制作流程图和草绘线框。整个过程都是通过协作完成，我们进行了两轮线框的用户测试，然后再将设计转向数字化。",
      "process&insight5": "从那里开始，我们制作了集情绪板，其中包括颜色搭配，图片，字体等。",
      "process&insight6": "然后，我们开始用Sketch制作线框并与测试了我们的纸制原型。在分析了纸制原型的测试的反馈之后，我们更新了测试稿词并开始了数字化模型的可用性测试。我们从第六周到第十周重复测试，在每轮测试之后我们讨论我们各自得到的用户反馈，并一起讨下一稿需要进行哪些更改。我们在6到10周内共同测试了大约50个用户。",
      "UsabilityTestScript": "可用性测试稿词",
      "process&insight7": "在第7周，我们开始使用Flinto在原型中添加动画和转场。因为前几个原型设计的可用性，导航栏经历了几次大修改。第10周我们确定了一个最终的原型设计，该原型经过了多轮的测试和验证。",
      "ReflectionNote": "测试结果报告",
      "solution_title": "最终方案",
      "solution1": "我们希望订餐体验尽可能简单快捷，这很大影响了我们的每个设计决策，因此我们删除了登陆和注册账号屏并且采用固定的卡片式购物车。 \n 主页允许用户立即进入菜单和订购过程。卡片式购物车固定在页面的底部。运营时间和帐户信息页面分别位于左屏和右屏，可以向左或向右滑动或通过点击导航栏中的相应图标来导航进入。\n 卡车当日的位置和时间显示在“关于”页面下，以便用户知道餐车是否已关门或者停车位置发生了变化。",
      "solution2": "根据用户的反馈，奖励机制、旧订单和帐户设置都在一个屏幕下以提供常规的帐户概览。 \n 自定义贝果订单将引导用户逐步执行流程，在此流程中，他们可以选择贝果类型，是否烤制，基本涂层和配料。每个贝果类型图标都根据Schmear It的设计样式所创建。 \n 结帐时允许顾客订购时选择取餐时间和地点。",
      "solution3": "付款屏会显示顾客的奖励机制状态（买十送一），并在完成结帐之前提醒他们是否可以兑现奖励。之外我们还接受多种付款方式，包括Apple Pay，以加快结帐速度。\n 确认订单屏清楚地显示了位置和预计的取餐时间，它还具有条形码，供商店在取餐时扫描。 \n 下单后，主屏幕上会显示订单状态的状态。",
      "solution_flinto-link": "下载Flinto原型",
      "result_title": "结果",
      "result": "根据品牌设计、应用易用性以及用户的反馈我们认为该项目非常成功。第一，我们满足了商业目标（推广自定义贝果订单），第二，根据用户反馈，用户对订餐体验的满意度逐周提高。该应用程序本身的订购过程非常简单，缺少初始注册屏幕，大大减少了新用户的首次设置。 \n 即使一个或两个成员在一周之内未能做到这一点，创造一致的会议时间确实有助于我们保持进度。由于项目开始由于小组成员的外部冲突而结束，这些会议变得不太一致，并影响了最终产品。将来，我们将对这些团队会议更加严格，并且至少在一周的课外举行一次。在团队之间共享Sketch和Flinto文件也被证明是一个障碍，因为团队需要进行多个版本的测试并且角色每周更改一次。"
    }
  }
}